content/cxf-basic/src/test/resources/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:sayHi xmlns:ns2="http://example.fusesource.org/">
            <arg0>Kylin Soong</arg0>
        </ns2:sayHi>
    </soap:Body>
</soap:Envelope>
